
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПарсингКонстанты();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СформироватьКонстанту();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура ЛогинПарольПриИзмененииНаСервере()
	
	Модифицированность = Истина;
    
КонецПроцедуры

&НаКлиенте
Процедура ЛогинПарольПриИзменении(Элемент)
	
	ЛогинПарольПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ПарсингКонстанты()
	
	Если ЗначениеЗаполнено(НаборКонстант.ЖИПК_ДанныеАгентаСервера) Тогда
		ЛогинПароль = СтрРазделить(НаборКонстант.ЖИПК_ДанныеАгентаСервера, ";");
		
		Если ЛогинПароль.Количество() > 0 Тогда
			Логин = ЛогинПароль[0];
			Если ЛогинПароль.Количество() > 1 Тогда
				Пароль = "Пароль введен";
			КонецЕсли;
			Если ЛогинПароль.Количество() > 2 Тогда
				IP = ЛогинПароль[2];
			КонецЕсли;
			Если ЛогинПароль.Количество() > 3 Тогда
				Порт = ЛогинПароль[3];
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКонстанту()
	
	НаборКонстант.ЖИПК_ДанныеАгентаСервера = Логин + ";" + Пароль + ";" + IP + ";" + Порт;
	
КонецПроцедуры

#КонецОбласти