
&НаСервере
Процедура ВыполнитьЗаписьХешСуммыКонфигурацииНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЖИПК_АнализПрикладныхРешенийРегл.ВыполнитьЗаписьХешСуммыКонфигурации();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаписьХешСуммыКонфигурации(Команда)
	ВыполнитьЗаписьХешСуммыКонфигурацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗаписьХешСуммыРасширенийНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЖИПК_АнализПрикладныхРешенийРегл.ВыполнитьЗаписьХешСуммыРасширений();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаписьХешСуммыРасширений(Команда)
	ВыполнитьЗаписьХешСуммыРасширенийНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗаписьХешСуммыДополнительныхНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЖИПК_АнализПрикладныхРешенийРегл.ВыполнитьЗаписьХешСуммыДополнительных();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаписьХешСуммыДополнительных(Команда)
	ВыполнитьЗаписьХешСуммыДополнительныхНаСервере();
КонецПроцедуры
