
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл

		Задание = РегламентныеЗаданияСервер.Задание(Запись.Идентификатор);
		
		Если Задание = Неопределено Тогда 
				
			ПараметрыЗадания = Новый Структура;
			ПараметрыЗадания.Вставить("Метаданные", 	Метаданные.РегламентныеЗадания.ЗапускДополнительныхОбработок);
			ПараметрыЗадания.Вставить("Использование", 	Запись.Использование);
			ПараметрыЗадания.Вставить("Наименование", 	"(ЖИПК) " + Строка(Запись.РегламентноеЗадание) );
			ПараметрыЗадания.Вставить("Ключ", 			Запись.Идентификатор);
			ПараметрыЗадания.Вставить("Расписание", 	Запись.Расписание.Получить() );
			
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка() );
			МассивПараметров.Добавить(Запись.РегламентноеЗадание);
			ПараметрыЗадания.Вставить("Параметры", 		МассивПараметров);
			
			Задание = РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
			
			Запись.Идентификатор = Задание.УникальныйИдентификатор;
			
		Иначе
			
			ПараметрыЗадания = Новый Структура;
			ПараметрыЗадания.Вставить("Метаданные", 	Метаданные.РегламентныеЗадания.ЗапускДополнительныхОбработок);
			ПараметрыЗадания.Вставить("Использование", 	Запись.Использование);
			ПараметрыЗадания.Вставить("Наименование", 	"(ЖИПК) " + Строка(Запись.РегламентноеЗадание) );
			ПараметрыЗадания.Вставить("Ключ", 			Запись.Идентификатор);
			ПараметрыЗадания.Вставить("Расписание", 	Запись.Расписание.Получить() );
			
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка() );
			МассивПараметров.Добавить(Запись.РегламентноеЗадание);
			ПараметрыЗадания.Вставить("Параметры", 		МассивПараметров);
		
			РегламентныеЗаданияСервер.ИзменитьЗадание(Запись.Идентификатор, ПараметрыЗадания);  
			
		КонецЕсли;			
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти