
#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьНовыйКлючАналитики(СтруктураДобавления) Экспорт
                        	
	ДобКлюч = Справочники.ЖИПК_КлючиАналитикиПрикладныхРешений.СоздатьЭлемент();
	ДобКлюч.Наименование = СтруктураДобавления.Наименование;
	ДобКлюч.ИдентификаторРешения = СтруктураДобавления.ИдентификаторРешения;
	ДобКлюч.Отсутствует = СтруктураДобавления.Отсутствует;
	ДобКлюч.ТипПрикладногоРешения = СтруктураДобавления.ТипПрикладногоРешения;
	
	Попытка
		ДобКлюч.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Процедура ПометитьОтсутствиеРешения(КлючАналитики) Экспорт

	Если ТипЗнч(КлючАналитики) <> Тип("СправочникСсылка.ЖИПК_КлючиАналитикиПрикладныхРешений") Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементОбъект = КлючАналитики.ПолучитьОбъект();
	ЭлементОбъект.Отсутствует = Истина;
	
	Попытка
		ЭлементОбъект.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Процедура СнятьОтметкуОтсутствияРешения(КлючАналитики) Экспорт

	Если ТипЗнч(КлючАналитики) <> Тип("СправочникСсылка.ЖИПК_КлючиАналитикиПрикладныхРешений") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не КлючАналитики.Отсутствует Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементОбъект = КлючАналитики.ПолучитьОбъект();
	ЭлементОбъект.Отсутствует = Ложь;
	
	Попытка
		ЭлементОбъект.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

