
#Область ПрограммныйИнтерфейс 

Процедура ОбработатьРегламентноеЗадание(ИдентификаторЗадания) Экспорт

	Если ИдентификаторЗадания = Перечисления.ЖИПК_РеглЗадание.РасчитатьХешСуммыДополнительных Тогда
		
		ЖИПК_АнализПрикладныхРешенийРегл.ВыполнитьЗаписьХешСуммыДополнительных();
		
	КонецЕсли;
	
	Если ИдентификаторЗадания = Перечисления.ЖИПК_РеглЗадание.РасчитатьХэшСуммуКонфигурации Тогда
		
		ЖИПК_АнализПрикладныхРешенийРегл.ВыполнитьЗаписьХешСуммыКонфигурации();
		
	КонецЕсли;
	
	Если ИдентификаторЗадания = Перечисления.ЖИПК_РеглЗадание.РасчитатьХэшСуммыРасширений Тогда
		
		ЖИПК_АнализПрикладныхРешенийРегл.ВыполнитьЗаписьХешСуммыРасширений();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти